extending.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0" dumptraffic="true">

  <clients>
    <client host="tsung-1" maxusers="200000"/>
  </clients>

  <servers>
    <server host="mim-1" port="5222" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="14400" unit="minute">
      <users maxnumber="1" interarrival="0.001" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option type="ts_jabber" name="global_number" value="100"></option>
    <option type="ts_jabber" name="userid_max" value="100000"></option>
    <option type="ts_jabber" name="domain" value="localhost"></option>
    <option type="ts_jabber" name="username" value="user"></option>
    <option type="ts_jabber" name="passwd" value="pass"></option>
  </options>

  <sessions>
   <session bidi="true" probability="100" name="xmpp" type="ts_jabber">

      <request subst="true">
        <jabber type="connect" ack="no_ack"/>
      </request>

      <thinktime value="1"/>

      <transaction name="auth">
        <request><jabber type="auth_sasl" ack="local"/></request>
        <request><jabber type="connect" ack="local"/></request>
        <request><jabber type="auth_sasl_bind" ack="local"/></request>
        <request><jabber type="auth_sasl_session" ack="local"/></request>
      </transaction>

      <thinktime value="1"/>

      <request subst="true">
        <jabber type="presence:initial" ack="local"/>
      </request>

      <thinktime value="1"/>

      <!-- request all the privacy lists from the server -->
      <request subst="true">
        <dyn_variable name="privacy_lists"
                      xpath="//iq[@type='result']/query/list/@name"/>
        <jabber type="raw" data="%%tsung_privacy:get_lists%%" ack="local"/>
      </request>

      <thinktime value="1"/>

      <request subst="true">
        <jabber type="raw" data="%%tsung_privacy:set_active%%" ack="no_ack"/>
      </request>

      <request subst="true">
        <jabber type="presence:final" ack="no_ack"/>
      </request>

  </session>
 </sessions>
</tsung>